In [1]:
# sales report

import pandas as pd

In [2]:
# import data from a csv
raw_data = pd.read_csv("data/electronic_store_sales.csv")

In [3]:
# get information about data
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Product Name      100 non-null    object
 1   Brand             100 non-null    object
 2   Price             100 non-null    float64
 3   Date              100 non-null    object
 4   Employee Sold By  100 non-null    object
 5   Customer Name     100 non-null    object
dtypes: float64(1), object(5)
memory usage: 4.8+ KB

In [4]:
raw_data.head() # first n number of rows (default 5)

,Product Name,Brand,Price,Date,Employee Sold By,Customer Name
0,Bluetooth Speaker,JBL,229.14,2025-10-24,Liam Smith,Sarah Lewis
1,VR Headset,Meta,2405.89,2025-11-08,Olivia Davis,Jacob Allen
2,Gaming Console,Nintendo,465.61,2025-01-23,Isabella Clark,Emily Johnson
3,VR Headset,Meta,2327.76,2025-01-31,William Lee,John Doe
4,External Hard Drive,Seagate,795.81,2025-06-08,Noah Brown,Andrew Young

In [5]:
raw_data.tail() # last n number of rows (default 5)

,Product Name,Brand,Price,Date,Employee Sold By,Customer Name
95,Router,TP-Link,1143.71,2025-07-12,Emma Wilson,Brian Walker
96,Gaming Console,Nintendo,977.94,2025-04-18,Emma Wilson,John Doe
97,Mouse,Razer,2328.26,2025-01-06,William Lee,Sophia Hall
98,Projector,Epson,2476.27,2025-09-19,James Carter,Ethan King
99,Smart Light,Philips,2285.81,2025-07-14,Noah Brown,Jane Smith

In [6]:
sellers = raw_data["Employee Sold By"]

In [7]:
sellers = pd.Series(sellers)

In [8]:
sold_by = {}
for name in sellers:
    if name in sold_by.keys():
        sold_by[name] += 1
    else:
        sold_by[name] = 1

print(sold_by)

{'Liam Smith': 8, 'Olivia Davis': 9, 'Isabella Clark': 10, 'William Lee': 13, 'Noah Brown': 9, 'Sophie Turner': 11, 'Emma Wilson': 13, 'Maria Lopez': 7, 'Alex Johnson': 9, 'James Carter': 11}

In [9]:
employee_sales_list = pd.DataFrame({"Employee":sold_by.keys(), "Product Sold":sold_by.values()})

In [10]:
employee_sales_list

         Employee  Product Sold
0      Liam Smith             8
1    Olivia Davis             9
2  Isabella Clark            10
3     William Lee            13
4      Noah Brown             9
5   Sophie Turner            11
6     Emma Wilson            13
7     Maria Lopez             7
8    Alex Johnson             9
9    James Carter            11

In [11]:
raw_data.loc[96, "Product Name"]

'Gaming Console'